{
  "BTQ": {
    "symbol": "BTQ",
    "shortName": "BTQ Technologies Corp.",
    "longName": "BTQ Technologies Corp.",
    "quoteType": "EQUITY",
    "exchange": "NGM",
    "market": "us_market",
    "sector": "Technology",
    "industry": "Software - Infrastructure",
    "country": "Canada",
    "city": "Vancouver",
    "longBusinessSummary": "BTQ Technologies Corp. engages in the development of computer-based technology related to post-quantum cryptography for applications in blockchain and related technologies. Its products include PQScale is a scaling mechanism for lattice-based post-quantum signatures, leveraging zero-knowledge proofs to compress digital signatures to achieve speed and cost savings; Keelung is a user-friendly toolkit for developing zero-knowledge proofs, featuring a domain-specific language embedded in Haskell and a compiler; as well as Kenting specializes in hardware acceleration tailored for zero-knowledge computation applications; and Quantum Proof-of-Work QPoW is an energy-efficient, post-classical consensus algorithm that uses Noisy Intermediate Scale Quantum hardware to authorize blockchain transactions. In addition, the company provides QRiNG product is a toolkit for quantum random number generation; Preon paves the path to a future-proof, digitally secure post-quantum signature scheme; and QByte, a quantum risk calculator. The company has a strategic collaboration with Industrial Technology Research Institute to validate BTQ's Quantum Compute In Memory (QCIM) chip, which is designed to enable secure, scalable cryptographic computation for the post-quantum era. The company was incorporated in 1983 and is headquartered in Vancouver, Canada.",
    "marketCap": 396973536,
    "enterpriseValue": 410093408,
    "beta": -19.594,
    "trailingPE": null,
    "forwardPE": -77.32487,
    "priceToBook": 14.110376,
    "dividendRate": null,
    "dividendYield": null,
    "payoutRatio": 0.0,
    "profitMargins": 0.0,
    "grossMargins": 1.0,
    "operatingMargins": -23.154839,
    "returnOnAssets": -0.39129,
    "returnOnEquity": -0.77671,
    "revenueGrowth": null,
    "earningsGrowth": null,
    "fullTimeEmployees": null,
    "ticker_input": "BTQ",
    "as_of": "2026-02-03T18:19:24.297166Z",
    "status": "matched"
  },
  "EFR": {
    "symbol": "EFR",
    "shortName": "Eaton Vance Senior Floating-Rat",
    "longName": "Eaton Vance Senior Floating-Rate Trust",
    "quoteType": "EQUITY",
    "exchange": "NYQ",
    "market": "us_market",
    "sector": "Financial Services",
    "industry": "Asset Management",
    "country": "United States",
    "city": "Boston",
    "longBusinessSummary": "Eaton Vance Senior Floating-Rate Trust is a closed-ended fixed income mutual fund launched and managed by Eaton Vance Management. The fund invests in the fixed income markets of the United States. It primarily invests in senior, secured floating rate loans. It benchmarks the performance of its portfolio against the S&P/LSTA Leveraged Loan Index. Eaton Vance Senior Floating-Rate Trust was formed on November 28, 2003 and is domiciled in the United States.",
    "marketCap": 328893120,
    "enterpriseValue": 507634464,
    "beta": 0.385,
    "trailingPE": 19.206898,
    "forwardPE": 111.4,
    "priceToBook": 0.89911216,
    "dividendRate": 0.92,
    "dividendYield": 8.26,
    "payoutRatio": 1.9,
    "profitMargins": 0.35659,
    "grossMargins": 1.0,
    "operatingMargins": 0.77813005,
    "returnOnAssets": 0.03982,
    "returnOnEquity": 0.03842,
    "revenueGrowth": -0.165,
    "earningsGrowth": 0.029,
    "fullTimeEmployees": null,
    "ticker_input": "EFR",
    "as_of": "2026-02-03T18:19:24.798283Z",
    "status": "matched"
  },
  "AMZN": {
    "symbol": "AMZN",
    "shortName": "Amazon.com, Inc.",
    "longName": "Amazon.com, Inc.",
    "quoteType": "EQUITY",
    "exchange": "NMS",
    "market": "us_market",
    "sector": "Consumer Cyclical",
    "industry": "Internet Retail",
    "country": "United States",
    "city": "Seattle",
    "longBusinessSummary": "Amazon.com, Inc. engages in the retail sale of consumer products, advertising, and subscriptions service through online and physical stores in North America and internationally. The company operates through three segments: North America, International, and Amazon Web Services (AWS). It also manufactures and sells electronic devices, including Kindle, fire tablets, fire TVs, echo, ring, blink, and eero; and develops and produces media content. In addition, the company offers programs that enable sellers to sell their products in its stores; and programs that allow authors, independent publishers, musicians, filmmakers, Twitch streamers, skill and app developers, and others to publish and sell content. Further, it provides compute, storage, database, analytics, machine learning, and other services, as well as advertising services through programs, such as sponsored ads, display, and video advertising. Additionally, the company offers Amazon Prime, a membership program. The company's products offered through its stores include merchandise and content purchased for resale and products offered by third-party sellers. It also provides AgentCore services, such as AgentCore Runtime, AgentCore Memory, AgentCore Observability, AgentCore Identity, AgentCore Gateway, AgentCore Browser, and AgentCore Code Interpreter. It serves consumers, sellers, developers, enterprises, content creators, advertisers, and employees. Amazon.com, Inc. was incorporated in 1994 and is headquartered in Seattle, Washington.",
    "marketCap": 2535719174144,
    "enterpriseValue": 2663535869952,
    "beta": 1.385,
    "trailingPE": 33.55021,
    "forwardPE": 30.244724,
    "priceToBook": 6.8580675,
    "dividendRate": null,
    "dividendYield": null,
    "payoutRatio": 0.0,
    "profitMargins": 0.11063,
    "grossMargins": 0.50046,
    "operatingMargins": 0.11057,
    "returnOnAssets": 0.07495,
    "returnOnEquity": 0.24327,
    "revenueGrowth": 0.134,
    "earningsGrowth": 0.364,
    "fullTimeEmployees": 1578000,
    "ticker_input": "AMZN",
    "as_of": "2026-02-03T18:19:25.202849Z",
    "status": "matched"
  },
  "NVDA": {
    "symbol": "NVDA",
    "shortName": "NVIDIA Corporation",
    "longName": "NVIDIA Corporation",
    "quoteType": "EQUITY",
    "exchange": "NMS",
    "market": "us_market",
    "sector": "Technology",
    "industry": "Semiconductors",
    "country": "United States",
    "city": "Santa Clara",
    "longBusinessSummary": "NVIDIA Corporation, a computing infrastructure company, provides graphics and compute and networking solutions in the United States, Singapore, Taiwan, China, Hong Kong, and internationally. The Compute & Networking segment includes its Data Centre accelerated computing platforms and artificial intelligence solutions and software; networking; automotive platforms and autonomous and electric vehicle solutions; Jetson for robotics and other embedded platforms; and DGX Cloud computing services. The Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro/NVIDIA RTX GPUs for enterprise workstation graphics; virtual GPU or vGPU software for cloud-based visual and virtual computing; automotive platforms for infotainment systems; and Omniverse software for building and operating industrial AI and digital twin applications. It also customized agentic solutions designed in collaboration with NVIDIA to accelerate enterprise AI adoption. The company's products are used in gaming, professional visualization, data center, and automotive markets. It sells its products to original equipment manufacturers, original device manufacturers, system integrators and distributors, independent software vendors, cloud service providers, consumer internet companies, add-in board manufacturers, distributors, automotive manufacturers and tier-1 automotive suppliers, and other ecosystem participants. The company has a strategic partnership with Siemens Aktiengesellschaft to develop industrial and physical AI solutions for AI-driven innovation to every industry and industrial workflow. NVIDIA Corporation was incorporated in 1993 and is headquartered in Santa Clara, California.",
    "marketCap": 4363226185728,
    "enterpriseValue": 4460536922112,
    "beta": 2.314,
    "trailingPE": 44.249382,
    "forwardPE": 23.38378,
    "priceToBook": 36.633278,
    "dividendRate": 0.04,
    "dividendYield": 0.02,
    "payoutRatio": 0.0099,
    "profitMargins": 0.53007,
    "grossMargins": 0.7005,
    "operatingMargins": 0.63168997,
    "returnOnAssets": 0.53528,
    "returnOnEquity": 1.07359,
    "revenueGrowth": 0.625,
    "earningsGrowth": 0.667,
    "fullTimeEmployees": 36000,
    "ticker_input": "NVDA",
    "as_of": "2026-02-03T18:19:25.552146Z",
    "status": "matched"
  },
  "UUUU": {
    "symbol": "UUUU",
    "shortName": "Energy Fuels Inc",
    "longName": "Energy Fuels Inc.",
    "quoteType": "EQUITY",
    "currency": "USD",
    "exchange": "ASE",
    "market": "us_market",
    "sector": "Energy",
    "industry": "Uranium",
    "country": "United States",
    "city": "Lakewood",
    "longBusinessSummary": "Energy Fuels Inc., together with its subsidiaries, engages in the exploration, recovery, recycling, exploration, operation, development, permitting, evaluation, and sale of uranium mineral properties in the United States. It produces and sells vanadium pentoxide, rare earth elements, carbonate, and heavy mineral sands, such as ilmenite, rutile, zircon, and monazite. The company was formerly known as Volcanic Metals Exploration Inc. and changed its name to Energy Fuels Inc. in May 2006. Energy Fuels Inc. was incorporated in 1987 and is headquartered in Lakewood, Colorado.",
    "marketCap": 5158524416,
    "enterpriseValue": 4851736576,
    "beta": 1.68,
    "trailingPE": null,
    "forwardPE": 118.99999,
    "priceToBook": 7.21455,
    "dividendRate": null,
    "dividendYield": null,
    "payoutRatio": 0.0,
    "profitMargins": -1.24166,
    "grossMargins": 0.061479997,
    "operatingMargins": -1.5057001,
    "returnOnAssets": -0.11005,
    "returnOnEquity": -0.18105,
    "revenueGrowth": 3.376,
    "earningsGrowth": null,
    "fullTimeEmployees": 1370,
    "ticker_input": "UUUU",
    "as_of": "2026-02-05T12:02:30.977419Z",
    "status": "matched"
  }
}